Revit 2027 API
DWFImportOptions Methods
The DWFImportOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSheetViews |  Get sheet views where DWF markups are imported.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetSheetViews |  Set sheet views where DWF markups are imported.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DWFImportOptions Class
Autodesk.Revit.DB Namespace